; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	infrared1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	GroundStation2 - direction
	Star3 - direction
	Star11 - direction
	GroundStation12 - direction
	GroundStation13 - direction
	GroundStation14 - direction
	Star4 - direction
	GroundStation7 - direction
	Star0 - direction
	Star6 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation9 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation8)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation9)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
)
(:goal (and
	(have_image Phenomenon15 spectrograph2)
	(have_image Star16 infrared3)
	(have_image Planet17 spectrograph2)
	(have_image Phenomenon19 infrared3)
	(have_image Star20 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation5 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 planet17 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet17)
   goals met: 0 of 5
5. (take_image satellite0 planet17 instrument1 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon19 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 phenomenon19)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon19 instrument1 infrared3)
   added: (have_image phenomenon19 infrared3)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon15 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon15 instrument1 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 3 of 5
10. (turn_to satellite0 star16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star16)
   goals met: 3 of 5
11. (take_image satellite0 star16 instrument1 infrared3)
   added: (have_image star16 infrared3)
   goals met: 4 of 5
12. (turn_to satellite0 star20 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star20)
   goals met: 4 of 5
13. (take_image satellite0 star20 instrument1 spectrograph0)
   added: (have_image star20 spectrograph0)
   goals met: 5 of 5
